1 - Crie um banco de dados

In [1]:
import sqlite3 as sql
BD_ESCOLA = sql.connect('BD_ESCOLA.db')
cursor = BD_ESCOLA.cursor()

EXCLUINDO QUANDO HOUVER ERRO

In [36]:
cursor.execute('DROP TABLE cursos')
cursor.execute('DROP TABLE alunos')
BD_ESCOLA.commit()

2 - Crie uma tabela chamada 'cursos' para armazenar informações sobre os cursos.                                        
A tabela deve ter uma coluna id que será a chave primária e outra com o nome do curso.

In [37]:
cursor.execute('''CREATE TABLE IF NOT EXISTS cursos (id INTEGER PRIMARY KEY AUTOINCREMENT, nome_curso TEXT NOT NULL)''')
BD_ESCOLA.commit()

3 - Insira alguns registros na tabela 'cursos'

In [38]:
cursor.execute("INSERT INTO cursos (nome_curso) VALUES (?)", ("Modelagem de Software",))
cursor.execute("INSERT INTO cursos (nome_curso) VALUES (?)", ("Vida e Carreira",))
cursor.execute("INSERT INTO cursos (nome_curso) VALUES (?)", ("Soluções Computacionais",))
cursor.execute("INSERT INTO cursos (nome_curso) VALUES (?)", ("Ambientes Virtuais",))
BD_ESCOLA.commit()

In [39]:
cursor.execute('''SELECT * FROM cursos ''')
dates=cursor.fetchall()
for date in dates:
    print(date)

(1, 'Modelagem de Software')
(2, 'Vida e Carreira')
(3, 'Soluções Computacionais')
(4, 'Ambientes Virtuais')


4 - Crie uma tabela chamada 'alunos' com as seguintes colunas: id, nome, nota e curso_id

In [40]:
cursor.execute('''
    CREATE TABLE IF NOT EXISTS alunos (
        id INTEGER PRIMARY KEY AUTOINCREMENT, 
        nome TEXT NOT NULL, 
        nota REAL NOT NULL,
        curso_id INTEGER,
        FOREIGN KEY (curso_id) REFERENCES cursos(id)
    )
''')
BD_ESCOLA.commit()

5 - Insira alguns registros na tabela 'alunos' com referência aos cursos

In [41]:
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Gabriel',10,1))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Pedro',8,2))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Pablo',5,3))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Paulo',4,1))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Daniel',6,4))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Arthur',5,2))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Guilherme',7,4))
cursor.execute('INSERT INTO alunos (nome,nota,curso_id) VALUES (?, ?, ?)', ('Eduarda',9,3))
BD_ESCOLA.commit()

In [42]:
cursor.execute('''SELECT * FROM alunos''')
dates=cursor.fetchall()
for date in dates:
    print(date)

(1, 'Gabriel', 10.0, 1)
(2, 'Pedro', 8.0, 2)
(3, 'Pablo', 5.0, 3)
(4, 'Paulo', 4.0, 1)
(5, 'Daniel', 6.0, 4)
(6, 'Arthur', 5.0, 2)
(7, 'Guilherme', 7.0, 4)
(8, 'Eduarda', 9.0, 3)

6 - Faça consultas SQL para recuperar informações dos alunos e seus cursos 

a. Selecione todos os alunos e seus cursos

b. Selecione os alunos com notas acima de 7

c. Selecione os alunos com nota acima de 7 e seus respectivos cursos

In [43]:
# A)
cursor.execute('''
    SELECT alunos.nome, cursos.nome_curso 
    FROM alunos 
    INNER JOIN cursos ON alunos.curso_id=cursos.id ''')
dados = cursor.fetchall()
for dado in dados:
    print(dado)

('Gabriel', 'Modelagem de Software')
('Pedro', 'Vida e Carreira')
('Pablo', 'Soluções Computacionais')
('Paulo', 'Modelagem de Software')
('Daniel', 'Ambientes Virtuais')
('Arthur', 'Vida e Carreira')
('Guilherme', 'Ambientes Virtuais')
('Eduarda', 'Soluções Computacionais')

In [44]:
# B)
cursor.execute('SELECT nome FROM alunos WHERE nota>7')
dates = cursor.fetchall()
for date in dates:
    print(date)

('Gabriel',)
('Pedro',)
('Eduarda',)

In [46]:
cursor.execute('''SELECT * FROM alunos INNER JOIN cursos ON alunos.curso_id = cursos.id ''')
dates=cursor.fetchall()
for date in dates:
    print(date)

(1, 'Gabriel', 10.0, 1, 1, 'Modelagem de Software')
(2, 'Pedro', 8.0, 2, 2, 'Vida e Carreira')
(3, 'Pablo', 5.0, 3, 3, 'Soluções Computacionais')
(4, 'Paulo', 4.0, 1, 1, 'Modelagem de Software')
(5, 'Daniel', 6.0, 4, 4, 'Ambientes Virtuais')
(6, 'Arthur', 5.0, 2, 2, 'Vida e Carreira')
(7, 'Guilherme', 7.0, 4, 4, 'Ambientes Virtuais')
(8, 'Eduarda', 9.0, 3, 3, 'Soluções Computacionais')

In [47]:
# C)
cursor.execute('''
               SELECT alunos.nome, cursos.nome_curso 
               FROM alunos INNER JOIN cursos WHERE NOTA>7 and alunos.curso_id= cursos.id''')
dates = cursor.fetchall()
for date in dates:
    print(date)

('Gabriel', 'Modelagem de Software')
('Pedro', 'Vida e Carreira')
('Eduarda', 'Soluções Computacionais')

Listar conteúdo das tabelas

7 - Crie um script para alterar a tabela de 'alunos' retirando as colunas nota e curso_id.

In [50]:
cursor.execute('''ALTER TABLE cursos DROP CONSTRAINT curso_id''') # removendo restrição de FK
# cursor.execute('''ALTER TABLE alunos DROP COLUMN curso_id''') # Em seguida, remova a coluna
cursor.execute('''ALTER TABLE alunos DROP COLUMN nota''')
BD_ESCOLA.commit()

OperationalError: near "CONSTRAINT": syntax error

8 - Crie uma tabela 'Disciplinas' para receber as colunas nota e curso_id que devem ser retiradas da tabela alunos e os dados respectivos e adicione uma chave estrangeira para o aluno_id

In [ ]:
cursor.execute('''CREATE TABLE IF NOT EXISTS disciplinas LIKE (nota,curso_id) FROM alunos
    INSERT INTO table2
(column_name1, column_name2, ...)
SELECT column_name1, column_name2, ...
FROM table1;
    nota DOUBLE NOT NULL, curso_id TEXT NOT NULL
    
    )''')

9 - Atualizar os nomes das disciplinas dos cursos conforme a seguir:

1 - Curso de Matemática 1 - FUNDAMENTOS DE ÁLGEBRA 3 - GEOMETRIA PLANA 6 - HISTÓRIA DA MATEMÁTICA
2 - Curso de Hstória 2 - HISTÓRIA ANTIGA 5 - HISTÓRIA MODERNA 7 - HISTÓRIA DA IDADE MÉDIA
3 - Curso de Ciências 4 - CIENCIAS DA NATUREZA 8 - CIENCIAS FISICAS E QUIMICAS 9 - CIENCIAS BIOLOGICAS

In [ ]:
cursor.execute(''' ''')

In [ ]:
cursor.execute("DELETE FROM cursos WHERE nome_curso = ?", ("Modelagem",))
cursor.execute("SELECT * FROM alunos WHERE nota>6 ")
dados = cursor.fetchall()
for dado in dados:
    print(dado)

In [ ]:
BD_ESCOLA.close()